vicherarr/camesp32/esp32_repeater/esp32_cam_sec/sdkconfig.defaults
# ESP32-S3 Camera & BLE Configuration
CONFIG_IDF_TARGET="esp32s3"

# Flash 16MB configuration
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# Single large app partition (3.9MB factory partition)
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# Enable BLE (NimBLE)
CONFIG_BT_ENABLED=y
CONFIG_BT_BLE_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=y

# Camera and PSRAM settings
CONFIG_ESP32S3_SPIRAM_SUPPORT=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
# Do NOT abort boot if PSRAM can't be initialised (prevents boot loop:
# lets BLE come up even when PSRAM/camera are absent or in a different mode)
CONFIG_SPIRAM_IGNORE_NOTFOUND=y

# FreeRTOS clock
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=y
